Функция КонтрагентыЗаказов(МассивЗаказов) Экспорт

	КоллекцияКонтрагентов = Новый Массив;
	
	Для каждого ЭлементЗаказа Из МассивЗаказов Цикл
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	_ДемоЗаказПокупателя.Контрагент КАК Контрагент
		|ИЗ
		|	Документ._ДемоЗаказПокупателя КАК _ДемоЗаказПокупателя
		|ГДЕ
		|	_ДемоЗаказПокупателя.Ссылка = &ЭлементЗаказа");
		
		Запрос.УстановитьПараметр("ЭлементЗаказа", ЭлементЗаказа);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КоллекцияКонтрагентов.Добавить(ВыборкаДетальныеЗаписи.Контрагент);
		КонецЦикла;
	КонецЦикла;	
	
	Возврат КоллекцияКонтрагентов;
	
КонецФункции

