#Область ПрограммныйИнтерфейс

Функция КонтрагентыЗаказов(МассивЗаказов) Экспорт

	КоллекцияКонтрагентов = Новый Массив;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	_ДемоЗаказПокупателя.Контрагент КАК Контрагент
	|ИЗ
	|	Документ._ДемоЗаказПокупателя КАК _ДемоЗаказПокупателя
	|ГДЕ
	|	_ДемоЗаказПокупателя.Ссылка В(&Заказы)");
		
	Запрос.УстановитьПараметр("Заказы", МассивЗаказов);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоллекцияКонтрагентов.Добавить(ВыборкаДетальныеЗаписи.Контрагент);
	КонецЦикла;

	Возврат КоллекцияКонтрагентов;

КонецФункции

#КонецОбласти